#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/heder24/juicebox/runs/run-XVsqi7Mtvin5pkdY

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
data.aws_route53_zone.heder_lab_zone: Refreshing...
module.prod_bastion.data.aws_partition.current: Refreshing...
data.aws_availability_zones.available: Refreshing...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c7b255d958444183]
module.prod_bastion.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_ami.ubuntu: Refreshing...
module.base-ec2-role.data.aws_caller_identity.current: Refreshing...
module.prod_asg.data.aws_default_tags.current: Refreshing...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refreshing...
module.base-ec2-role.data.aws_partition.current: Refreshing...
module.prod_asg.data.aws_partition.current: Refreshing...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refreshing...
module.base-ec2-role.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refresh complete after 0s [id=1021377347]
module.prod_asg.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refresh complete after 0s [id=2053943846]
module.prod_asg.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
data.aws_eip.bastion_eip: Refreshing...
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::312029113425:policy/vpc-flow-log-to-cloudwatch-20231110163640610800000001]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231110163640613000000002]
module.base-ec2-role.data.aws_caller_identity.current: Refresh complete after 0s [id=312029113425]
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=3095392050]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-2]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231110163640613000000002-20231110163640862200000003]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-073e5edf4b5d15fc8]
data.aws_eip.bastion_eip: Refresh complete after 0s [id=eipalloc-003f1118979070f7a]
data.aws_route53_zone.heder_lab_zone: Refresh complete after 0s [id=Z10479661QT4EPRK5O3JF]
module.dns_records.data.aws_route53_zone.this[0]: Refreshing...
module.private_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0646922af605f7203]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0b1ee06a1530a40d5]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0c7b255d958444183]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0eaea8311c7bbfd63]
module.public_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0fb44b710daa5abdc]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02a2106fbc5d0f614]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-023b84bb1e0647d02]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod20231110163652250400000006/237a74ea7fef7ab6]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01aa0cb98bb61057d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0dd6151491ac20db7]
module.bastion_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d70d696752d6f248]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-089150f4a89ce2628]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05bf0ef94c24d363d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0492b32cf69d5c7c7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ba1aa7c756385824]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02a2106fbc5d0f6141080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-086874167d30640b8]
module.private_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-2028230941]
module.private_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1295268862]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0cc09fe218a07fc6a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a9dfc3c0c52519f2]
module.dns_records.data.aws_route53_zone.this[0]: Refresh complete after 1s [id=Z10479661QT4EPRK5O3JF]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08414697785e34c05]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09ca61e2eee7f3191]
module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-1673465154]
module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[1]: Refreshing state... [id=sgrule-1897785503]
module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1]: Refreshing state... [id=sgrule-798943733]
module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-3622757753]
module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1378500257]
module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-3833519983]
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1208681189]
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2059923930]
module.bastion_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1456562686]
module.bastion_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-2398879446]
module.bastion_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1237271394]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00ca2be10d636da30]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0cbc52b6ffdd77ff0]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a84da32ddfd8b05f]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[1]: Refreshing state... [id=sgrule-2383646152]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3156395742]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[2]: Refreshing state... [id=sgrule-3150482019]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05954ef0eab628318]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0eaea8311c7bbfd631080289494]
module.bastion_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.private_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.vpc.aws_nat_gateway.this[0]: Drift detected (update)
module.vpc.aws_route_table.public[0]: Drift detected (update)
module.vpc.aws_route_table.private[0]: Drift detected (update)
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Drift detected (update)
module.vpc.aws_eip.nat[0]: Drift detected (update)
module.public_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[1]: Drift detected (update)
module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[1]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-003f1118979070f7a"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "prod"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0b1ee06a1530a40d5",
          + "sg-0fb44b710daa5abdc",
        ]
      + subnets                                     = [
          + "subnet-01aa0cb98bb61057d",
          + "subnet-023b84bb1e0647d02",
          + "subnet-0dd6151491ac20db7",
        ]
      + tags                                        = {
          + "MyLoadBalancer" = "prod-lb"
          + "Name"           = "prod"
        }
      + tags_all                                    = {
          + "MyLoadBalancer" = "prod-lb"
          + "Name"           = "prod"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod20231110163652250400000006/237a74ea7fef7ab6"
          + type             = "forward"
        }
    }

  # module.base-ec2-role.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "base-ec2-role-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "base-ec2-role-1"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.base-ec2-role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "base-ec2-role-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.base-ec2-role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "base-ec2-role-1"
    }

  # module.base-ec2-role.aws_iam_role_policy_attachment.custom[1] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMFullAccess"
      + role       = "base-ec2-role-1"
    }

  # module.dns_records.aws_route53_record.this["hederdevops.com A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hederdevops.com"
      + type            = "A"
      + zone_id         = "Z10479661QT4EPRK5O3JF"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dns_records.aws_route53_record.this["www.hederdevops.com A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.hederdevops.com"
      + type            = "A"
      + zone_id         = "Z10479661QT4EPRK5O3JF"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.prod_asg.aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + default_instance_warmup          = 300
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "prod"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod20231110163652250400000006/237a74ea7fef7ab6",
        ]
      + termination_policies             = []
      + vpc_zone_identifier              = [
          + "subnet-0492b32cf69d5c7c7",
          + "subnet-05bf0ef94c24d363d",
          + "subnet-0ba1aa7c756385824",
        ]
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "GithubOrg"
          + propagate_at_launch = true
          + value               = "hederdevops"
        }
      + tag {
          + key                 = "GithubRepo"
          + propagate_at_launch = true
          + value               = "heder-class-devops"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-web"
        }

      + timeouts {}
    }

  # module.prod_asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "prod launch template"
      + id                     = (known after apply)
      + image_id               = "ami-073e5edf4b5d15fc8"
      + instance_type          = "t2.micro"
      + key_name               = "main-us-east-2"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "lt-prod-"
      + tags                   = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all               = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCiNVbmluc3RhbGwgVW5vZmZpY2lhbCB2ZXJzaW9ucyAKCmZvciBwa2cgaW4gZG9ja2VyLmlvIGRvY2tlci1kb2MgZG9ja2VyLWNvbXBvc2UgZG9ja2VyLWNvbXBvc2UtdjIgcG9kbWFuLWRvY2tlciBjb250YWluZXJkIHJ1bmM7IGRvIHN1ZG8gYXB0IHJlbW92ZSAkcGtnIC15OyBkb25lCgojIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjICBTZXQgdXAgRG9ja2VyJ3MgQXB0IHJlcG9zaXRvcnkuICMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIwojIEFkZCBEb2NrZXIncyBvZmZpY2lhbCBHUEcga2V5OgpzdWRvIGFwdC1nZXQgdXBkYXRlIC15CnN1ZG8gYXB0LWdldCBpbnN0YWxsIGNhLWNlcnRpZmljYXRlcyBjdXJsIGdudXBnIC15CnN1ZG8gaW5zdGFsbCAtbSAwNzU1IC1kIC9ldGMvYXB0L2tleXJpbmdzCmN1cmwgLWZzU0wgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dS9ncGcgfCBzdWRvIGdwZyAtLWRlYXJtb3IgLW8gL2V0Yy9hcHQva2V5cmluZ3MvZG9ja2VyLmdwZwpzdWRvIGNobW9kIGErciAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnIAoKIyBBZGQgdGhlIHJlcG9zaXRvcnkgdG8gQXB0IHNvdXJjZXM6CmVjaG8gXAogICJkZWIgW2FyY2g9IiQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkiIHNpZ25lZC1ieT0vZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnXSBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1IFwKICAiJCguIC9ldGMvb3MtcmVsZWFzZSAmJiBlY2hvICIkVkVSU0lPTl9DT0RFTkFNRSIpIiBzdGFibGUiIHwgXAogIHN1ZG8gdGVlIC9ldGMvYXB0L3NvdXJjZXMubGlzdC5kL2RvY2tlci5saXN0ID4gL2Rldi9udWxsCnN1ZG8gYXB0LWdldCB1cGRhdGUgLXkKCgojaW5zdGFsbCB0aGUgRG9ja2VyIHBhY2thZ2VzLiAKCnN1ZG8gYXB0LWdldCBpbnN0YWxsIGRvY2tlci1jZSBkb2NrZXItY2UtY2xpIGNvbnRhaW5lcmQuaW8gZG9ja2VyLWJ1aWxkeC1wbHVnaW4gZG9ja2VyLWNvbXBvc2UtcGx1Z2luIC15CgoKIyBTdGFydCBhbmQgRW5hYmxlIERvY2tlciAKc3VkbyBzZXJ2aWNlIGRvY2tlciBzdGFydApzdWRvIHNlcnZpY2UgZG9ja2VyIGVuYWJsZQoKI0FkZCB1c2VyIGN5YmVyIHRvIGRvY2tlciBncm91cCBhbmQgVXBkYXRlIERvY2tlciBQZXJtaXNzaW9uIApzdWRvIHVzZXJtb2QgLWEgLUcgZG9ja2VyIGN5YmVyCnN1ZG8gY2htb2QgNjY2IC92YXIvcnVuL2RvY2tlci5zb2NrCgojIFJ1biBPV0FTUCBKdWljZSBTaG9wIENvbnRhaW5lcgoKZG9ja2VyIHB1bGwgYmtpbW1pbmljaC9qdWljZS1zaG9wCmRvY2tlciBydW4gLWQgLXAgODA6MzAwMCBia2ltbWluaWNoL2p1aWNlLXNob3A="

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + delete_on_termination = "true"
          + description           = "eth0"
          + device_index          = 0
          + security_groups       = [
              + "sg-0646922af605f7203",
            ]
        }

      + placement {
          + availability_zone = "eu-east-2b"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "GithubOrg"  = "hederdevops"
              + "GithubRepo" = "heder-class-devops"
              + "Name"       = "prod"
              + "WhatAmI"    = "Instance"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "GithubOrg"  = "hederdevops"
              + "GithubRepo" = "heder-class-devops"
              + "Name"       = "prod"
              + "WhatAmI"    = "Volume"
            }
        }
    }

  # module.prod_bastion.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-073e5edf4b5d15fc8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-us-east-2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0dd6151491ac20db7"
      + tags                                 = {
          + "Name" = "prod-bastion"
        }
      + tags_all                             = {
          + "Name" = "prod-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + volume_tags                          = {
          + "Name" = "prod-bastion"
        }
      + vpc_security_group_ids               = [
          + "sg-0d70d696752d6f248",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                                = (known after apply)
  + alb_zone_id                                 = (known after apply)
  + ec2_id                                      = (known after apply)
  + iam_instance_profile_id                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @heder24, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*